Pet/app/controllers/pets_controller.rb

    def index
    @pets = Animal.all
---
SELECT "animals".* FROM "animals" ORDER BY  ASC

    def show
    @pet = Animal.find(params[:id])
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def species
       @species = Animal.where(species: params[:species])
---
SELECT "animals".* FROM "animals" WHERE "animals"."species" = ?  [["species", "cats"]]